# Question-1

In this question, we will use the csv file **bank.csv**. 
- a. Read it into a data frame, call it `df`. (Import the packages you think you need).
- b. Drop the following columns:
    ['default','poutcome','y','housing','contact','day','month','duration','campaign','pdays','previous']

In [1]:
import pandas as pd
import numpy as np

In [2]:
#### (a) Your code here
df = pd.read_csv('bank.csv', delimiter = ';')
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

In [3]:
#### (b) Your code here
df.drop(columns = ['default','poutcome','y','housing','contact','day','month','duration','campaign','pdays','previous'],
       inplace = True)
df

       age           job   marital  education  balance loan
0       58    management   married   tertiary     2143   no
1       44    technician    single  secondary       29   no
2       33  entrepreneur   married  secondary        2  yes
3       47   blue-collar   married    unknown     1506   no
4       33       unknown    single    unknown        1   no
...    ...           ...       ...        ...      ...  ...
45206   51    technician   married   tertiary      825   no
45207   71       retired  divorced    primary     1729   no
45208   72       retired   married  secondary     5715   no
45209   57   blue-collar   married  secondary      668   no
45210   37  entrepreneur   married  secondary     2971   no

[45211 rows x 6 columns]

## Question-2
Try to discover this data:
- a. Find the number of rows and columns.
- b. Find the data type of each one of the columns.
- c. Find the total number of missing values and the number of missing values in each column if any (Note that "unknown" is considerd as missing value).
- d. Replace all missing values with the most common value in each columns 
- e. Find all unique values of each categorical column.
- f. Find the mean, min, max of each numerical column.

In [4]:
#### (a) Your code here
print('rows:'+ str(len(df)))
print('cols:'+ str(df.shape[1]))

rows:45211
cols:6

In [5]:
#### (b) Your code here
df.dtypes

age           int64
job          object
marital      object
education    object
balance       int64
loan         object
dtype: object

In [6]:
#### (c) Your code here
df.replace('unknown', np.nan, inplace=True)
print('missing values for each column:')
df.isna().sum()

missing values for each column:

age             0
job           288
marital         0
education    1857
balance         0
loan            0
dtype: int64

In [7]:
print('total number of missing value: ' +str(df.isna().sum().sum()))

total number of missing value: 2145

In [8]:
#### (d) Your code here
fill_mode = lambda col: col.fillna(col.mode()[0], inplace=True)
df.apply(fill_mode, axis=0)
df

       age           job   marital  education  balance loan
0       58    management   married   tertiary     2143   no
1       44    technician    single  secondary       29   no
2       33  entrepreneur   married  secondary        2  yes
3       47   blue-collar   married  secondary     1506   no
4       33   blue-collar    single  secondary        1   no
...    ...           ...       ...        ...      ...  ...
45206   51    technician   married   tertiary      825   no
45207   71       retired  divorced    primary     1729   no
45208   72       retired   married  secondary     5715   no
45209   57   blue-collar   married  secondary      668   no
45210   37  entrepreneur   married  secondary     2971   no

[45211 rows x 6 columns]

In [9]:
#e:
for col in df:
    if df[col].dtype == 'object':
        print(col)
        print(df[col].unique())

job
['management' 'technician' 'entrepreneur' 'blue-collar' 'retired' 'admin.'
 'services' 'self-employed' 'unemployed' 'housemaid' 'student']
marital
['married' 'single' 'divorced']
education
['tertiary' 'secondary' 'primary']
loan
['no' 'yes']

In [10]:
#f
df.describe()
#median is 50%

                age        balance
count  45211.000000   45211.000000
mean      40.936210    1362.272058
std       10.618762    3044.765829
min       18.000000   -8019.000000
25%       33.000000      72.000000
50%       39.000000     448.000000
75%       48.000000    1428.000000
max       95.000000  102127.000000

In [11]:
print('age:')
print('mean: '+ str(df['age'].mean()))
print('min: '+ str(df['age'].min()))
print('max: '+ str(df['age'].max()))
print()
print('balance:')
print('mean: '+ str(df['balance'].mean()))
print('min: '+ str(df['balance'].min()))
print('max: '+ str(df['balance'].max()))

age:
mean: 40.93621021432837
min: 18
max: 95

balance:
mean: 1362.2720576850766
min: -8019
max: 102127

## Question-3

- a. We learned that there is one more record. Add the information of the following record to the DataFrame:
        0,42,management,married,secondary,3266,no
- b. Verify that the new record was added to the end of the dataframe
- c. Drop all rows where education is primary.
- d. Reset the index and remove the new created column (index)

#### (a) Your code here
#new_row = pd.DataFrame({'age':42, 'job':'management', 'marital':'married', 'education':'secondary', 'balance':3266, 'loan': 'no'})#index=[0])
#df = pd.concat([new_row,df.loc[:]]).reset_index(drop=True)
#df.append(new_row)
#df

row = pd.Series({'age':42, 'job':'management', 'marital':'married', 'education':'secondary', 'balance':3266, 'loan': 'no'},name=0)
#df = df.append(row)
df.concat(df,row)
df

In [12]:
#### (a) Your code here
new_row = pd.DataFrame({'age':42, 'job':'management', 'marital':'married', 'education':'secondary', 'balance':3266, 'loan': 'no'},index=[0])
df = pd.concat([df, new_row])
df.tail()

       age           job   marital  education  balance loan
45207   71       retired  divorced    primary     1729   no
45208   72       retired   married  secondary     5715   no
45209   57   blue-collar   married  secondary      668   no
45210   37  entrepreneur   married  secondary     2971   no
0       42    management   married  secondary     3266   no

In [13]:
#### (b) Your code here
df.iloc[len(df)-1]

age                  42
job          management
marital         married
education     secondary
balance            3266
loan                 no
Name: 0, dtype: object

In [14]:
#### (c) Your code here
#df.drop(subset = ['education'])
df = df[df.education != 'primary']
df

       age           job  marital  education  balance loan
0       58    management  married   tertiary     2143   no
1       44    technician   single  secondary       29   no
2       33  entrepreneur  married  secondary        2  yes
3       47   blue-collar  married  secondary     1506   no
4       33   blue-collar   single  secondary        1   no
...    ...           ...      ...        ...      ...  ...
45206   51    technician  married   tertiary      825   no
45208   72       retired  married  secondary     5715   no
45209   57   blue-collar  married  secondary      668   no
45210   37  entrepreneur  married  secondary     2971   no
0       42    management  married  secondary     3266   no

[38361 rows x 6 columns]

In [15]:
#### (d) Your code here
#df.reset_index().remove
df = df.reset_index(drop = True)
df

       age           job  marital  education  balance loan
0       58    management  married   tertiary     2143   no
1       44    technician   single  secondary       29   no
2       33  entrepreneur  married  secondary        2  yes
3       47   blue-collar  married  secondary     1506   no
4       33   blue-collar   single  secondary        1   no
...    ...           ...      ...        ...      ...  ...
38356   51    technician  married   tertiary      825   no
38357   72       retired  married  secondary     5715   no
38358   57   blue-collar  married  secondary      668   no
38359   37  entrepreneur  married  secondary     2971   no
38360   42    management  married  secondary     3266   no

[38361 rows x 6 columns]

## Question-4

- a. Find the number of people of 'secondary' education level.
- b. Compare between the average of the balance of married and single people
- c. Find the mean and the standard deviation of the balance of each education level.
- d. Find the mean and the standard deviation of the balance of each job.
- e. What is the average balance for different education groups and marital status?
- f. Compare between the number of people who had loan (married vs single)
- g. Which job has the lowest mean balance?
- h. Which job has the highest number of loans?

In [16]:
#### (a) Your code here
print('people of secondary education: '+str(len(df[df.education == 'secondary'])))

people of secondary education: 25060

In [17]:
#### (b) Your code here
print('Average of balance of married people: '+ 
      str(df[df.marital== 'married'].describe().iloc[1][1]))

Average of balance of married people: 1459.2657836041694

In [18]:
print('Average of balance of married people: '+ 
      str(df[df.marital== 'single'].describe().iloc[1][1]))

Average of balance of married people: 1313.665745162101

In [19]:
df.groupby('marital').mean()

                age      balance
marital
divorced  44.818855  1185.825365
married   42.657608  1459.265784
single    33.490073  1313.665745

In [20]:
#### (c) Your code here
#df[df.education== 'secondary'].describe()
print('mean of the balance of each education level:')
df.groupby('education').mean()['balance']

mean of the balance of each education level:

education
secondary    1182.521668
tertiary     1758.416435
Name: balance, dtype: float64

In [21]:
#df[df.education== 'tertiary'].describe()
print('std of the balance of each education level:')
df.groupby('education').std()['balance']

std of the balance of each education level:

education
secondary    2608.646435
tertiary     3839.088305
Name: balance, dtype: float64

In [22]:
#### (d) Your code here
print('mean of the balance of each job:')
df.groupby('job').mean()['balance']

mean of the balance of each job:

job
admin.           1144.488714
blue-collar      1101.068588
entrepreneur     1499.311350
housemaid        1662.561175
management       1766.711839
retired          2040.860449
self-employed    1676.433402
services          999.852192
student          1395.174497
technician       1247.649550
unemployed       1505.420650
Name: balance, dtype: float64

In [23]:
print('std of the balance of each job:')
df.groupby('job').std()['balance']

std of the balance of each job:

job
admin.           2673.269119
blue-collar      2241.948530
entrepreneur     4052.855186
housemaid        3595.206174
management       3843.539170
retired          4557.834171
self-employed    3792.758504
services         2194.894642
student          2470.152290
technician       2549.988593
unemployed       3233.733642
Name: balance, dtype: float64

In [24]:
#### (e) Your code here
print('average balance for different education groups and marital status:')
df.groupby(['education','marital']).mean()['balance']

average balance for different education groups and marital status:

education  marital
secondary  divorced     931.904491
           married     1275.661443
           single      1092.552694
tertiary   divorced    1700.917063
           married     1848.779341
           single      1643.351210
Name: balance, dtype: float64

In [25]:
print('grouping by education only')
df.groupby(['education']).mean()['balance']

grouping by education only

education
secondary    1182.521668
tertiary     1758.416435
Name: balance, dtype: float64

In [26]:
print('grouping by marital state only')
df.groupby(['marital']).mean()['balance']

grouping by marital state only

marital
divorced    1185.825365
married     1459.265784
single      1313.665745
Name: balance, dtype: float64

In [27]:
#### (f) Your code here
df.groupby(['loan','marital']).size()

loan  marital
no    divorced     3634
      married     18125
      single      10382
yes   divorced      821
      married      3844
      single       1555
dtype: int64

In [28]:
print('number of married people with loan: '+ 
      str(len(df[(df['marital'] == 'married') & (df['loan'] == 'yes')])))
print('number of single people with loan: '+ 
      str(len(df[(df['marital'] == 'single') & (df['loan'] == 'yes')])))

number of married people with loan: 3844
number of single people with loan: 1555

In [29]:
#### (g) Your code here
df.groupby('job').mean()['balance']

job
admin.           1144.488714
blue-collar      1101.068588
entrepreneur     1499.311350
housemaid        1662.561175
management       1766.711839
retired          2040.860449
self-employed    1676.433402
services          999.852192
student          1395.174497
technician       1247.649550
unemployed       1505.420650
Name: balance, dtype: float64

In [30]:
print('the job with the lowest average balance: ' + df.groupby('job').mean().idxmin()[1])

the job with the lowest average balance: services

In [31]:

df['loan'].replace('no',0, inplace = True)
df['loan'].replace('yes',1, inplace = True)
df

       age           job  marital  education  balance  loan
0       58    management  married   tertiary     2143     0
1       44    technician   single  secondary       29     0
2       33  entrepreneur  married  secondary        2     1
3       47   blue-collar  married  secondary     1506     0
4       33   blue-collar   single  secondary        1     0
...    ...           ...      ...        ...      ...   ...
38356   51    technician  married   tertiary      825     0
38357   72       retired  married  secondary     5715     0
38358   57   blue-collar  married  secondary      668     0
38359   37  entrepreneur  married  secondary     2971     0
38360   42    management  married  secondary     3266     0

[38361 rows x 6 columns]

In [32]:
df.groupby(['job'])['loan'].sum()

job
admin.            953
blue-collar      1105
entrepreneur      316
housemaid          70
management       1197
retired           213
self-employed     210
services          769
student            12
technician       1283
unemployed         92
Name: loan, dtype: int64

In [33]:
print('job with the highest number of loans: '+
      str(df.groupby(['job'])['loan'].sum().idxmax()))

job with the highest number of loans: technician